core_onvif/onvifsend/PtzFocus.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
  %1
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <Move xmlns="http://www.onvif.org/ver20/ptz/wsdl">
      <VideoSourceToken>%2</VideoSourceToken>
      <Focus>
        <Continuous>
          <Speed>%3</Speed>
        </Continuous>
      </Focus>
    </Move>
  </s:Body>
</s:Envelope>